In [2]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
d = {
    'one': [1, 1, 1, 1, 1],
    'two': [2, 2, 2, 2, 2],
    'letter': ['a', 'a', 'b', 'b', 'c']
}
df = pd.DataFrame(d)
df

  letter  one  two
0      a    1    2
1      a    1    2
2      b    1    2
3      b    1    2
4      c    1    2

In [5]:
# Group by with letter and sum
df.groupby('letter').sum()

        one  two
letter
a         2    4
b         2    4
c         1    2

In [8]:
# Group by with mutil column
letter_one = df.groupby(['letter', 'one']).sum()

In [14]:
# Data type cua group by la MultiIndex
letter_one

            two
letter one
a      1      4
b      1      4
c      1      2

AttributeError: 'DataFrame' object has no attribute 'names'

In [17]:
a = {
    1: 'a value',
    'key': 31.12,
    (1, 'immutable'): range(20)
}
str

{(1, 'immutable'): range(0, 20), 1: 'a value', 'key': 31.12}